Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: A good background of algorithms and software already constructed by various developers allows us to implement our environment by means of adaptation of the techniques used by biologists to the background.
ru: Хорошая база алгоритмов и программного обеспечения, уже созданных различными разработчиками, позволяет нам реализовать среду при помощи адаптации методов, используемых биологами, к существующему инструментарию.

source: A great introductory tutorial can be found here.
ru: Хороший учебник по программе находится здесь.

source: A home has multiple devices (laptop, desktop, Chromecast, printer, etc.), and therefore each home network will need multiple IP addresses.
ru: В доме есть несколько устройств (ноутбук, настольный компьютер, принтер и т.д.), Поэтому для каждого устройства в домашней сети потребуется свои IP-адреса.

source: A local environment variable is one that is set during a shell session and is erased when the shell is closed.
ru: Сеансовая (локальная) переменная среды - это переменная, которая устанавливается во время конкретного сеанса оболочки и стирается при его закрытии.

source: A more common example for regular expressions is searching large documents for email addresses or phone numbers or even validating user input in a web application.
ru: Более распространенным примером регулярных выражений является поиск в больших документах адресов электронной почты или номеров телефонов или даже проверка ввода данных пользователем в веб-приложении.

source: A multi-agent algorithm for distribution of the modules between environment nodes realizing a possible computation instance of the scheme has been developed.
ru: Разработан мультагентный эвристический алгоритм для распределения прикладных модулей между узлами среды исполнения, реализуюзего вариант вычислительной схемы.

source: A multiset represents the set of resources owned by an agent at a time moment.
ru: Мультимножество представляет собой набор ресурсов, принадлежащих агенту в конкретный момент времени.

source: A novel object-oriented macro extension Logtalk will be used for knowledge representation as components.
ru: Новый объектно-ориентированный макро-язык Logtalk будет использоваться для представления знаний в виде программных компонентов.

source: A popular way of overcoming the complexity of object representation is usage of visual models, where various aspects are represented with corresponding visual images.
ru: Популярным способом преодоления сложности представления объекта является использование визуальной модели, где различные аспекты представляются соответствующими визуальными образами.

source: A process can start another process (usually the terminal starting a new process as a result of a command typed into it) by first creating a copy of itself, and then executing the new command within that copied process.
ru: Каждый процесс может начать другой процесс (обычно терминал начинает новый процесс в результате введенной команды), сначала создавая свою копию, а затем выполняя новую команду в адресном пространстве скопированного процесса.

source: A programming language is not a language without functions, so here is the basic syntax for writing and then later calling a function in your bash script.
ru: Язык программирования - это не язык программирования, если в нем нет функций. Расмотрим базовый синтаксис для создания и последующего вызова функции в сценарии bash.

source: A quick example:
ru: Вот простой пример:

source: A resource-driven game like approaches are applied in distribution of the load in a heterogeneous distributed computing environment [1].
ru: Подходы, похожие на ресурсо-управляемые игры, использованы при решении задачи планирования нагрузки в гетерогенной распределенной вычислительной среде [1].

source: A shell script can take arguments on the command line.
ru: Сценарий bash может принимать аргументы через командную строку.

source: A total DNA is extracted from a sample, resulting in a general image of the microbiome.
ru: Из образца извлекается общая ДНК, в результате чего создается информация, общая для целого микробиома.

source: ATL, QVT have common basis metamodel (MOF, Meta-object facility), which implies practically data structures for UML element representation.
ru: У ATL и QVT общая так называемая метамодель (MOF, Meta-object facility), которая практически представляет структуры данных, используемые для представления лементов UML (Unified modeling language).

source: Above are three separate HTTP response headers from three separate requests I made to www.google.com.
ru: Выше приведены три разных заголовка HTTP-ответов, полученные в результате запуска трех запросов к сайту www.google.com.

source: Above, you are specifying a host of “everything” (you could replace with a domain such as github.com), and telling the agent to use the keychain, add keys, and use the two identity files listed as logins.
ru: Указание поля Host * обозначает возможность подключения к любому серверу. Символ * можно заменить доменом, например github.com. Кроме того, настройка сообщает агенту использовать связку ключей, добавлять ключи и использовать два файла идентификации, перечисленные как "пароли" к удаленным соединениям.

source: According to GT, we are to determine such sequence of actions (“strategy”), leading to the end of the conflict (i.e. final resource bases of the players), which meets goals of both or at least one of the opponents, who is declared winner.
ru: В соответствии с ТИ, необходимо определить такую последовательность действий (стратегию), которая приведет к разрешению конфликта (т.е., к финальной РБ игроков), отвечающей целям обоих или хотя бы одного из противников, который объявляется победителем.

source: Across the world, there are thousands of servers that are running for a single purpose.
ru: По всему миру тысячи серверов работают для одной цели.

source: Actual memory statistics.
ru: Cтатистика использования оперативной памяти.

source: Add the following to my-simple-script.
ru: Теперь надо добавить этот текст в my-simple-script.

source: Adding the two together gives you the “network” or “default gateway” address.
ru: Их объединение дает адрес «сети» или «шлюза по умолчанию».

source: Adding your keys to the ssh-agent (if applicable)
ru: Добавление ключей в ssh-agent (если приемлемо)

source: Advanced Bash
ru: Bash, новый уровень

source: After each execution, a Mothur command adds suffixes to the input file names.
ru: После каждого выполнения команда Mothur добавляет суффиксы к именам входных файлов.

source: After each splitting and transition set of constraints are checked.
ru: После каждого расщепления и перевода системы в новое состояние проверяется набор ограничений.

source: After executing the technique manually, we observed a number of issues.
ru: После выполнения техники вручную мы обнаружили ряд проблем.

source: After running this command, you now have all the jpg pictures in your entire home directory copied to a centralized backup repository!
ru: После выполнения этой команды, все изображения jpg из домашнего каталога будут скопированы в централизованное хранилище резервных копий!

source: After that the amount of additional resources to be spent to implement the reaction is accounted, The similar technique is used to assess possible risks in startups.
ru: После этого оценивается величина дополнительных ресурсов, которые будут затрачены на реализацию реагирования, подобная методика используется и для оценки возможных рисков в стартапах.

source: After the scenario is fulfilled the resulting object is one-to-one interpreted as the text representation of a PCF and modifier definition language.
ru: После того, как сценарий будет выполнен, то полученный объект один-к-одному интерпретируется в виде текстовоге представления ПОФ и языка задания модификаторов стратегии логического вывода.

source: After this stage we can make one final filtering, removing mitochondrial and chloroplast rRNA.
ru: После этого этапа произведем одну заключительную фильтрацию, удалив митохондриальные и хлоропластные рРНК.

source: After trimming oligos, one must remove shorter- and longer–than–average sequences.
ru: После обрезки олигонуклеотидов необходимо удалить последовательности короче и длиннее среднего.

source: After trimming “hanging” readings characters and filtering unaligned ones, we applied again selection of the unique sequences, resulted in 21052 unique ones.
ru: После обрезки «висящих» символов прочтений и фильтрации невыровненных, мы снова выборали уникальные последовательности, в результате получилось 21052 уникальных.

source: Again, I would recommend just using a built-in find/replace utility if it is available (like in VSCode), but sometimes this is not accessible.
ru: Опять же, эта операция элементарно реализуется в текстовых редакторах типа VSCode, но иногда к реадактору нет доступа, или есть необходимость выполнения операции над группой файлов, в скрипте.

source: Again, the grep utility is useful for quick searches when you do not have access to your normal text editor like VSCode.
ru: Таким образом, утилита grep полезна для быстрого поиска, если у вас нет доступа к текстовому редактору, например, VSCode, или нет желания ждать, пока он загрузится.

source: Agents form multi-agent system (MAS).
ru: Агенты образуют многоагентную систему (МАС).

source: Aiming at the predictive control method with limited resources, Asadi et al.
ru: Разрабатывая методы прогнозирующего управления с ограниченными ресурсами, Asadi et al.

source: Alexey Shigarov
ru: Алексей Шигаров

source: All I did was add \.com at the end of our regular expression for a literal match (we had to “escape” the period here because otherwise it refers to all characters as it did earlier in the expression.
ru: Все, что было сделано, - это добавление \ .com в конце нашего регулярного выражения, при этом требуем буквального совпадения (пришлось «экранировать» точку, потому что в противном случае она относится ко всем символам, как это было в предыдущих вариантах выражений).

source: All I did was add the $ character at the end of each expression.
ru: Все, что было сделано, - это добавиление $, сопоставляемый с концом строки.

source: All further behavior of the modelled STS until some final state will be explicated by MAS itself.
ru: Все дальнейшее поведение моделируемого СТО до некоторого конечного состояния будет проявлено само по себе.

source: All standard software development techniques, e.g., test-driven development, are applied for the modular knowledge development.
ru: Все стандартные методики разработки программного обеспечения, например, разработка через тестирование, применимы и для разработки модульных знаний.

source: All that “internet connectivity” that your ISP is providing is useless unless you use it, so we first need to make an internet request to see it in action.
ru: Подключение к Интернету, предоставляемое провайдером, бесполезно, если оно не используется, поэтому сначала нужно сделать интернет-запрос, чтобы увидеть его в действии.

source: All the possible grammar inferences results in multisets of various consequences.
ru: Все возможные результаты выводов (следствий) на грамматиках представляются в виде мультимножеств.

source: All the processes are constantly fighting for the resources and will take turns using them.
ru: Процессы конкурируют за системные ресурсы, вытесняя друг друга.

source: All these mathematical structures are compatible with DES representations; development of data structures for representation of RDG as DES is a new problem in IT, as well as the amounts of structural and behavioral data of modelled object forces the research to use intelligent and visual technologies to represent the object and convert its representation into data to be processed with computer simulation and control synthesis software.
ru: Все эти математические структуры совместимы с моделями ДСС; разработка структур данных для представления РУИ в ДСС - это новая задача в области информационных технологий; объем структурных и поведенческих данных моделируемого объекта требует применения в исследованиях интеллектуальных и визуальных технологий для представления объекта исследования, а также разработку программного обеспечения для преобразования его визуального представления в данные, обрабатываеные в процессе имитационного моделирования и синтеза управления.

source: All we had to do was add an “@” symbol followed by the same thing we had before the symbol.
ru: Все, что нужно было сделать, - это добавить символ «@», до и после него - наборы любых символов (кроме концов строк).

source: Almost all existing methods of formalizing the DESs (automata models, Petri nets, Markov chains, queuing systems, generalized semi-Markov processes, minimax algebras and algebra of events) imply the possibility of influencing the behavior of the system, based on the situational approach.
ru: Почти все существующие методы формализации ДСС (автоматные модели, сети Петри, цепи Маркова, системы массового обслуживания, обобщенных полумарковских процессов, минимаксные алгебры и алгебры событий) предполагают, что существует возможность влияния на поведение системы [на основе ситуационного подхода].

source: Almost each operation adds new suffixes.
ru: Почти каждая операция добавляет новые суффиксы.

source: Also, people also like to mask their sequences to remove variable regions using a soft or hard mask (e.g. Lane's mask).
ru: Кроме того, исследователи иногда используют маскирование последовательностей для удаления сильно изменчивых областей, используя мягкие и жесткие маски (например, маску Лейна).

source: Alternative approach, which consideration in the context of RBC may have evident reasons, have raised from the artificial intelligence area.
ru: Альтернативный подход, который применяется в контексте РК, по очевидным причинам появился из области искусственного интеллекта.

source: Although ls is considered a “command” in many people’s minds, it is really just another process.
ru: Команда ls на самом деле - это просто еще один процесс операционной системы.

source: Although a complex process, it all happens in seconds (or even milliseconds).
ru: Этт процесс происходит за секунды (или даже миллисекунды).

source: Although in most cases starting at #1 would make sense, we need to understand what an internet service provider (ISP) is and what service it provides.
ru: В большинстве случаев все начинается с шага №1, тут необходимо понимать, что такое интернет-провайдер (ISP) и какие услуги он предоставляет.

source: Although this tutorial is not meant to cover regular expressions in detail, I could also search by a regular expression.
ru: Хотя это руководство не преследует целью детально описать регулярные выражения, все же рассмотрим простой пример.

source: Although very powerful, this also can be very dangerous if you are not careful.
ru: Хотя это очень здорово, но и очень опасно, если не соблюдать осторожность, ясно представлять, что будет происходить во время исполнения команды.

source: Ambartsumyan for supervisory control of structured DES modeled using Petri nets (ref.
ru: Амбарцумяна посвящены супервизорному управлению структурированными ДСС, представляемыми в виде сетей Петри (

source: American Control Conference, 2001, Proceedings of the 2001, IEEE, 2001, 4: 3142-3143.), the physical coupling among subsystems are considered, and the communication network is utilized to obtain Nash equilibrium solution for the optimization of each subsystem output through repeated iteration of coupling among subsystems, with the constraints being satisfied; in that case the system performance is optimized.
ru: American Control Conference, 2001, Proceedings of the 2001, IEEE, 2001, 4: 3142-3143.), рассмотрена задача физического сопряжение подсистем с целью получения оптимальных характеристик системы, при этом сеть взаимодействия агентов используется для получения равновесия Нэша при одновременной оптимизации выхода (output) каждой подсистемы итеративно, обеспечивая одновременно выполнение всех ограничений.

source: An ISP is simply a company that owns hardware (wires) and makes that hardware available to customers in the form of internet service.
ru: Интернет-провайдер - это компания, которая владеет оборудованием и подключает к этому оборудованию клиентов, таким образом предоставляя ему интернет-услуги.

source: An address space is the range of IP addresses available for devices in a network (i.e. 192.0.168.1, 192.0.168.2, 192.0.168.3, 192.0.168.4, …, 192.0.168.254)
ru: Адресное пространство - это диапазон IP-адресов, доступных для устройств в сети (например, 192.0.168.1, 192.0.168.2, 192.0.168.3, 192.0.168.4,…, 192.0.168.254)

source: An environment variable can come in two sizes–global or local.
ru: Переменная среды может быть глобальной или локальной.

source: An example of a heatmap diagram
ru: Пример тепловой карты

source: An inference result of theorems represented with PCFs with subformulas corresponding to the controlled system and the requirements, which are to be hold, a conclusion is being drawn on the possibility to construct a corresponding supervisor control, or, in case of the impossibility of inference construction, a set of the system parameters are given, which prevent the inference.
ru: Из результатов логических выводов теорем, представленных в язука ПОФ, где подформулы соответствуют управляемым системам и требованиям, которые должны выполняться, выводится заключение о возможности построить соответствующее супервизорное управление, или, в случае невозможности построить такой вывод, выдается перечень параметров системы, которые препятствуют построению вывода.

source: An opposite approach is the compensation of the event appearance consequences, forcing the system in an admissible state with spending a reserved resource.
ru: Противоположный подход состоит в компенсации последствий появления события, вводящей систему в приемлемое состояние с расходованием некоторого зарезервированного ресурса.

source: Analysis of amplicons is applied to investigation of the microbiota of different environments of lake Baikal [2].
ru: Анализ ампликонов применяется для изучения микробиоты различных сред Байкала [2].

source: Analysis of the domain being scientific interest of our colleagues from PRC showed, that the object, large-scale manufacturing processes are represented as STS.
ru: Анализ предметной области, представляющей научный интерес наших коллег из КНР показал, что объект крупномасштабных производственных процессов представим в виде СТО.

source: And that is not even considering the last metacharacter that we are going to cover!
ru: И это даже без учета последнего метасимвола, который сейчас посмотрим.

source: Another example of DSS is system for generation of routine maintenance of petroleum equipment on the base of its structure analysis and modeling of kinetics and dynamics of material destruction.
ru: Еще один пример СППР - это система для порождения регламентных работ по обслуживанию нефтяного оборудования на основе анализа его структуры, моделирования кинетики и динамики разрушения материалов.

source: Another tool is UGENE [20], it is a desktop application, open-source, written with QT5 framework, and also under active development.
ru: Другой инструмент - UGENE [20], это настольное приложение с открытым исходным кодом, основанное на платформе QT5, также находится в активной разработке.

source: Another useful application of the netstat utility is to see what processes on your computer are using what ports.
ru: Еще одно полезное приложение утилиты netstat - узнать, какие порты используют ("окрыли") процессы на компьютере.

source: Another useful features of the PCFs inference is the ability to adjust to the properties of the domain.
ru: Еще одним полезным свойством логический выводов ПОФ является способность адаптироваться к свойствам предметной области.

source: Another way to use grep is through piping.
ru: Еще один способ использования grep - в режиме фильтра вывода другой команды.

source: Another well known DNS server is Google, which runs at the IP address 8.8.8.8.
ru: Другой хорошо известный DNS-сервер - это Google, работающий по IP-адресу 8.8.8.8.

source: Any of these three servers will know what IP address thediygolfer.com maps to.
ru: Любой из этих трех серверов будет знать, какой IP-адрес соответствует thediygolfer.com.

source: Anyways, back to our discussion… We have a bunch of data packets coming from the website server and being delivered to our router.
ru: В любом случае, вернемся к нашему обсуждению ... У нас есть несколько пакетов данных, которые приходят с сервера веб-сайта и доставляются на наш маршрутизатор.

source: Anyways, if we run this, we will again match all six lines of the text file.
ru: В любом случае, если запустить сопоставление, все шесть строк текстового файла будут сопоставимы.

source: Application of the techniques for control synthesis to testing RDDESU with external uncertainties represented as competing agents actions.
ru: Применение методов синтеза управления для тестирования РУДССН с неопределенностями, возникающими извне в следствии действий конкурирующих агентов.

source: Apply early developed methods for supervisor control synthesis to the RDDESU.
ru: Примение ранее разработаных методов синтеза супервизорного управления к РУДССН.

source: Applying the alignment to our 21170 sequences changed lengths of readings from average 407 to exact 871, filling them with gaps.
ru: Применение выравнивания к имеющимся 21170 последовательностям изменило длину считывания со средней 407 до точной 871, заполнив соответствующие места пробелами.

source: Approaches to model adaptation include the following opposites: machine learning, which is fashionable approach nowadays, and optimal control of dynamical systems, which have more complex mathematical methods in its foundation.
ru: Подходы к адаптации модели включают следующие противоположности: машинное обучение, которое является модным направлением в настоящее время, и оптимальное управление динамическими системами, которое основывается на более сложных математических методах.

source: Architecture of metadata processing services of the cloud
ru: Архитектура сервисов обработки метаданных облаках

source: As a normal bash user you will not use most of the capabilities, but we will look at some useful and common ones.
ru: Обычные пользователи bash не используют большинство этих возможностей, приведем самые полезные.

source: As a note, you generally do not need this shebang as in most cases, your bash shell will execute the scripts by default with bash, but it is good practice and increases portability if you add it.
ru: В принципе этот шабанг обычно не обязательный, поскольку в большинстве случаев оболочка bash будет выполнять сценарии по умолчанию с помощью bash, однако добавления его в скрипт - это хорошая практика и увеличивает переносимость кода скрипта.

source: As a result of this, the library would open up a new Excel workbook for every function call I made.
ru: Целью эксперимента была возможность открытия новой книги Excel при каждом вызове функции.

source: As mentioned, we are going to perform a basic search for the homepage of my website, www.thediygolfer.com.
ru: Как уже упоминалось, Для выполнения поиска на главной странице сайта www.thediygolfer.com

source: As optional step, we “relaxed” the difference between sequences allowing one additional mutation per 100 base pairs, reducing their number to 14234.
ru: В качестве необязательного шага применено «мягое» сравнение последовательносте, допускающее одну дополнительную мутацию на 100 пар оснований, количество уникальных прочтений уменьшилось до 14234.
